In [1]:
2+2

4

In [2]:
a=2

In [3]:
b=5

In [4]:
c=a+b

In [5]:
c

7

In [6]:
c*2

14

In [7]:
5000+5-2-1-0*10%2

5002

In [8]:
100%2

0

In [9]:
100/2

50.0

In [10]:
siddhant pagal

SyntaxError: invalid syntax (Temp/ipykernel_7472/919582798.py, line 1)

In [11]:
siddhant pagal

SyntaxError: invalid syntax (Temp/ipykernel_7472/60540156.py, line 1)

In [12]:
print(siddhant pagal)

SyntaxError: invalid syntax (Temp/ipykernel_7472/3347090963.py, line 1)

In [13]:
print('siddhant pagal')

siddhant pagal

In [14]:
print(myname is king')

SyntaxError: EOL while scanning string literal (Temp/ipykernel_7472/1675384127.py, line 1)

In [15]:
print('myname is king')

myname is king

In [17]:
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

NameError: name 'pd' is not defined

In [18]:
import pandas as pd
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

In [19]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [2]:
with open ("C:/Users/Shrut Thakur/Pictures/Data Science/data visualization/Files/helloworld.txt", "r") as myfile:
    data = myfile.read().splitlines()

In [3]:
f=open("C:/Users/Shrut Thakur/Pictures/Data Science/data visualization/Files/helloworld.txt",'r')
f.read()

'Hello World\nThis is my first program in python via To Print Hello world\nusing Import file in Python.'

In [4]:
import pandas as pd

In [9]:
countryDetails='C:/Users/Shrut Thakur/Pictures/Data Science/data visualization/Files/country.csv'

In [10]:
df = pd.read_csv (countryDetails)

In [11]:
df

    Country Name
0       malaysia
1   kuala lumpur
2        vietnam
3          hanoi
4        myanmar
5         yangon
6      australia
7       canberra
8            usa
9     washington
10        russia
11        moscow
12      thailand
13       bangkok
14            uk
15        london
16     sri lanka
17       colombo
18         china
19       beijing
20         japan
21         tokyo
22        brazil
23           rio

In [25]:
import pandas as pd

In [32]:
df = pd.read_excel ('C://Users//Shrut Thakur//Pictures//Data Science//data visualization//FIles//clientlist.xls')

In [33]:
df

  Person Name Country   Product Purchase Price
0         Jon   Japan  Computer           $800
1        Bill      US    Tablet           $450
2       Maria  Canada   Printer           $150
3        Rita  Brazil    Laptop         $1,200
4        Jack      UK   Monitor           $300
5         Ron   Spain    Laptop         $1,200
6        Jeff   China    Laptop         $1,200
7      Carrie   Italy  Computer           $800
8       Marry    Peru  Computer           $800
9         Ben  Russia   Printer           $150

In [37]:
dfsvc = pd.read_csv ("C:\\Users\\Shrut Thakur\\Pictures\\Data Science\\data visualization\\FIles\\test.csv")

In [38]:
dfsvc

  Person Name Country   Product Purchase Price
0         Jon   Japan  Computer           $800
1        Bill      US    Tablet           $450
2       Maria  Canada   Printer           $150
3        Rita  Brazil    Laptop         $1,200
4        Jack      UK   Monitor           $300
5         Ron   Spain    Laptop         $1,200
6        Jeff   China    Laptop         $1,200
7      Carrie   Italy  Computer           $800
8       Marry    Peru  Computer           $800
9         Ben  Russia   Printer           $150